SELECT s.ФИО, SUM(c.время_разговора) AS время_разговора_по_суткам
FROM Звонки c
JOIN Абоненты s ON c.номер_телефона = s.телефон
GROUP BY s.ФИО;


SELECT *
FROM Звонки c
WHERE c.время_разговора > 5;


SELECT c1.*
FROM Звонки c1
JOIN Звонки c2 ON c1.номер_телефона = c2.номер_телефона
AND c1.дата_разговора = c2.дата_разговора
AND c1.время_разговора = c2.время_разговора + 1
WHERE c1.время_разговора <= 5;


SELECT s.ФИО,
       COUNT(c.номер_телефона) AS количество_звонков_в_день,
       AVG(c.время_разговора) AS среднее_время_разговора,
       PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY c.время_разговора) AS медиана_разговора,
       MAX(c.время_разговора) - MIN(c.время_разговора) AS размах_разговора
FROM Абоненты s
LEFT JOIN Звонки c ON s.телефон = c.номер_телефона
GROUP BY s.ФИО;
